[
  {
    "name": "Cub Tiger From Kwang Tung",
    "synopsis": "Hsiao Hu (Jackie Chan) has been secretly training in martial arts, as his father (Tien Feng) has forbidden him. Later, some local store owners ask him to help protect them from a greedy Chinese extortion ring. Hsiao Hu discovers that the crime lord behind the extortion had killed his father years before and is determined for revenge.",
    "trailer": "g5WAzYyziRU",
    "year": 1973,
    "rating": 5.5,
    "must": "",
    "period": "Modern",
    "genre": [
      "Kung Fu",
      ""
    ],
    "director": [
      "Lau Suen",
      ""
    ],
    "review": "Jackie Chan's first starring role, also known as The Cub Tiger from Kwang Tung. Jackie was only 17 here and it shows. I couldn't find a very good copy of this, and I believe the DVD I got was converted from the 35mm real to digital video by literally projecting it on a wall then filming the projected image. Many of the subtitles are illegible, but it doesn't matter because the plot is simple to a fault. In fact, there are almost no stakes in the movie. There's no explanation for why this gang keeps coming after Jackie. He's just a waiter at a noodle shop that wants nothing to do with them. There are a few good scenes, like Jackie's dad throwing a bunch of potted plants at him, and a few terrible scenes, like the rape, but overall the choreography is very bad, which makes it pretty much valuless as anything other than a time capsule. Tien Feng is fantastic as always.",
    "image": "https://upload.wikimedia.org/wikipedia/en/0/05/CubTigerFromKawngTung_DVDcover.jpg"
  },
  {
    "name": "New Fist of Fury",
    "synopsis": "A young kung fu master is hired to help protect the local martial arts school when it comes under attack by the Japanese.",
    "trailer": "uDqGiune6Bk",
    "year": 1976,
    "rating": 5,
    "must": "",
    "period": "Colonial",
    "genre": [
      "Kung Fu",
      ""
    ],
    "director": [
      "Lo Wei",
      ""
    ],
    "review": "I watched the severely edited 1980 version of this film, but I don't think the original would have been much better. The problem is that they hadn't figured out how to use Jackie yet. Though he is a bit smarmy there's basically no comedy to his character. Also the fights are bland and few of them even showcase Jackie. This was actually a sequel to \"Fist of Fury\" which starred Bruce Lee. Lo Wei was trying to recapture the success he'd had with Lee and it didn't pay off. The setup of the plot is actually good. Japan has occupied Taiwan and set up a karate school which serves as the villain. Then it becomes a showdown between karate and kung fu, which sounds cool but doesn't really pay off. There's a part where Jackie holds a sign over his head and walks triumphantly down the street that's pretty effective. It's almost messianic imagery. The ending is probably the most hilarious Chan freeze-frame on record.",
    "image": "https://upload.wikimedia.org/wikipedia/en/2/29/NewFistOfFury_poster.jpg"
  },
  {
    "name": "Shaolin Wooden Men",
    "synopsis": "A fighter vows not to speak until he finds the masked man who killed his father.",
    "trailer": "_7kl4S5f_e0",
    "year": 1976,
    "rating": 7.5,
    "must": "",
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      ""
    ],
    "director": [
      "Chen Chi Hwa",
      ""
    ],
    "review": "For an early film, Shaolin Wooden Men has a lot of directorial flair. There are many scenes that made me scream out loud with either terror or laughter. Chen Chi Hwa used a ludicrous amount of camera pans and zooms to sell the zaniness. The plot is cool, but not mold breaking. It gets quite predictable near the end. The upside is that this film is almost entirely training or fighting scenes, and each scene has a really neat visual concept. In one Jackie's master constructs a little device out of bamboo to spar with him because he's chained to a wall. It includes a foot pedal that hits Jackie in the groin. In another Jackie does an early iteration of his famous drunken boxing. Then there is the fight against the titular wooden men, which doesn't disappoint. The film's one real downside is a big one, unfortunately. Some of the actors in the movie can not fight, and it shows. In the widely available cut, and the one I watched, some of the action is edited to make it appear faster, but it was horribly done. Overall though, Shaolin Wooden Men is a very good time.",
    "image": "https://upload.wikimedia.org/wikipedia/en/0/00/ShaolinWoodenMen_DVDcover.jpg"
  },
  {
    "name": "To Kill WIth Intrigue",
    "synopsis": "Chin Chang Yin leads a gang known as the Killer Bees on a revenge mission to kill Cao Lei and his family, falling in love with Lei in the process.",
    "trailer": "dcjdsjItFmo",
    "year": 1977,
    "rating": 6,
    "must": "",
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      ""
    ],
    "director": [
      "Lo Wei",
      "Kim Jin-tae"
    ],
    "review": "To kill with intrigue is the closest I've seen to actual Peking Opera in a Chan film. The fights are reliant on trampolines, wire work, and reverse-motion. It's a nice style, and ther's plenty of actual fight choreography to back it up, but it doesn't have much thought to it. They're mostly relying on the special effects to carry the film, which they don't quite accomplish. There are a few shocking and funny moments, but none that are intended as comedy. Even though there's never any subtext, the plot still manages to be confusing. Even Jackie himself said as much in one of his books. I liked the mystical qualities of the movie, and I liked some of the characters. There's a great woman that follows Chan around the whole time and torments him. Unfortunately, it doesn't offer much pleasure for the Chan fans as he's truly underutilized here, and showcases none of his signature charn.",
    "image": "https://upload.wikimedia.org/wikipedia/en/c/cd/To_Kill_With_Intrigue.jpg"
  },
  {
    "name": "Half a Loaf of Kung Fu",
    "synopsis": "Jiang, a travelling acrobat, is willing to go to any length to achieve his dream of becoming a kung fu master.",
    "trailer": "RbV1BgZlGRY",
    "year": 1978,
    "rating": 6.5,
    "must": "",
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Chen Chi-Hwa",
      ""
    ],
    "review": "The intro to this movie is a fantastic standalone short film in it's own right. There's good character stuff throughout but the fights weren't fantastic until the very end. The climactic battle has a very good concept with Jackie reading different techniques from a manual and applying them during the fight. The plot is throw-away and centers around a meaningless McGuffin.",
    "image": "https://upload.wikimedia.org/wikipedia/en/5/5f/HalfLoafKungFu.jpg"
  },
  {
    "name": "Spiritual Kung Fu",
    "synopsis": "A witty orphan learns the five-style fists technique from Shaolin temple ghosts.",
    "trailer": "_Z6VF6SVacM",
    "year": 1978,
    "rating": 7,
    "must": "",
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Lo Wei",
      ""
    ],
    "review": "Cool concept in that the McGuffin is a certain style of Kung Fu that is the only thing that can beat the style used by the Big Bad. No one knows this style and so Chan gets some ghosts to teach him. There are lots of really cool old effects when the ghosts are involved in the fights.",
    "image": "https://upload.wikimedia.org/wikipedia/en/d/da/SpiritualKungFu_DVDcover.jpg"
  },
  {
    "name": "Snake in the Eagle's Shadow",
    "synopsis": "An orphan who has been raised at a kung fu school where he is treated as little more than a dogsbody and practice target for the students has a life-changing experience after helping an old peripatetic beggar.",
    "trailer": "POjzRfxpSls",
    "year": 1978,
    "rating": 9,
    "must": true,
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      ""
    ],
    "director": [
      "Yuen Woo-Ping",
      ""
    ],
    "review": "Super dense with fantastic fights and absolutely top-tier choreography. The action is surprisingly fluid for such an early film. There are really solid characters and story as well. It's simple but effective. This and his next film with Lo Wei, Snake & Crane Arts of Shaolin, were by far the best the pair had made together, and would be their last.",
    "image": "https://upload.wikimedia.org/wikipedia/en/e/ea/Snakeeagleshadow.jpg"
  },
  {
    "name": "Snake & Crane Arts of Shaolin",
    "synopsis": "Hsu Yiu Fong (Jackie Chan) guards a powerful book against numerous clans after the eight Shaolin masters who wrote it go missing.",
    "trailer": "k8OI77Za9C0",
    "year": 1978,
    "rating": 9,
    "must": true,
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      ""
    ],
    "director": [
      "Chen Chi Hwa",
      ""
    ],
    "review": "1978 really was the breakout year for Jackie Chan, and it defined his first era. The second wouldn't really start for another five or six years. Some people consider Jackie's first era to be his best, and Snake & Crane arts of Shaolin is a resounding example of why that is. The plot is bulletproof — just enough to build tension, but not enough to get bogged down in. The supporting characters and cast, though they are numerous, are all uniquely wonderful. Jackie is used perfectly here. His character is arrogant and always cracking wise. Those traits are motivated and grounded by the mysterious plot. The Kung Fu is fantastic, and if Jackie weren't missing from a significant portion of it later in the film then this might have been a more perfect score.",
    "image": "https://upload.wikimedia.org/wikipedia/en/5/52/Snake%26CraneArtsOfShaolin_DVDcover.jpg"
  },
  {
    "name": "Drunken Master",
    "synopsis": "Unable to see eye to eye with his father, completely broke, and with nowhere else to turn, young Wong Fei-Hung (Jackie Chan) grudgingly accepts the tutelage of Su Hua Chi (Siu Tien Yuen), a notoriously intoxicated martial arts master. Su Hua Chi teaches Wong the techniques of Drunken Boxing, an unusually fluid fighting style. Wong is then forced to put his new skills to the test when his father is targeted by deadly assassin, Thunderleg (Jang Lee Hwang), who has never lost a fight.",
    "trailer": "KQMNllz6aE0",
    "year": 1978,
    "rating": 8,
    "must": true,
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Yuen Woo-Ping",
      ""
    ],
    "review": "This was when Jackie solidified himself with Golden Harvest and as a new Chinese super star, the first to break free of the ghost of Bruce Lee. There's a bit of a lull in the middle and some of the characters like Jackie's cousin and aunt disappear without a trace. Once Jackie starts drinking the movie's a blast. It has a great training montage and there are lots of fantastic fights with great concepts.",
    "image": "https://upload.wikimedia.org/wikipedia/en/4/43/DrunkenMasterMoviePoster.jpg"
  },
  {
    "name": "Dragon Fist",
    "synopsis": "A kung-fu student (Jackie Chan) avenges the slaying of his master, with help from his master's clan.",
    "trailer": "VP8lZSPTYWk",
    "year": 1979,
    "rating": 5,
    "must": false,
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      ""
    ],
    "director": [
      "Lo Wei",
      ""
    ],
    "review": "Lo Wei was always trying to make Jackie into a cold blooded killer, and it never worked. Dragon Fist is another in a long list of such attempts. Usually this wouldn't be completely damning in itself, but Dragon Fist is infuriatingly hard to follow, and so there is no tension to any of the action. The fights themselves are wonderfully choreographed (By Chan), but poorly executed. This is likely due to expediency on the part of Lo Wei and the terrible editing throughout the film. Jackie is missing in most of the fights until the end as well.",
    "image": "https://upload.wikimedia.org/wikipedia/en/8/8c/DragonFist_DVDcover.jpg"
  },
  {
    "name": "The Fearless Hyena",
    "synopsis": "After the death of his grandfather, Shing Lung utilises a secret form of kung fu as he pursues revenge.",
    "trailer": "23Bc5FjDtmI",
    "year": 1979,
    "rating": 8.5,
    "must": true,
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Jackie Chan",
      ""
    ],
    "review": "Fearless Hyena perfectly fuses comedy right into the action. It has several hilarious scenes in which Jackie's looking for a job. Later he has to fight in disguise and the characters he's playing makes each fight unique. The final showdown has a cool but very wacky concept.",
    "image": "https://upload.wikimedia.org/wikipedia/en/9/98/Fearlesshyena.jpg"
  },
  {
    "name": "The Master With Cracked Fingers",
    "synopsis": "A young fighter (Jackie Chan) avenges his father's death with a secret style the snake fist.",
    "trailer": "HseSnkd0pJ0",
    "year": 1979,
    "rating": 6,
    "must": "",
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Chu Mu",
      "Jackie Chan",
      ""
    ],
    "review": "There are some fantastic scenes but they're actually stolen from the older film, \"Little Tiger of Canton\". The end fight isn't even Jackie Chan, it's a guy in a wig",
    "image": "https://upload.wikimedia.org/wikipedia/en/7/7c/MasterWithCrackedFingersHKDVD.jpg"
  },
  {
    "name": "The Big Brawl",
    "synopsis": "In the 1930s an effete Chicago mobster (Jose Ferrer) pits a Chinese kicker (Jackie Chan) against a king-size brute called Kiss.",
    "trailer": "AAV8n83we_o",
    "year": 1980,
    "rating": 6,
    "must": "",
    "period": "1930's",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Robert Clouse",
      ""
    ],
    "review": "This is one of the earliest movies to showcase how Jackie's stunt team elevates him so much. He's pulling his punches the whole time against the Americans. Also there are lots of plot holes and bad dialog. However, there are a few really cool scenes peppered in including a roller derby race.",
    "image": "https://upload.wikimedia.org/wikipedia/en/b/bd/Bigbrawlposter.jpg"
  },
  {
    "name": "The Young Master",
    "synopsis": "Martial arts mayhem and mistaken identity silliness ensue when Dragon is sent to find his errant brother following a martial arts competition.",
    "trailer": "MiYkE_7HV2w",
    "year": 1980,
    "rating": 9.5,
    "must": true,
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Jackie Chan",
      ""
    ],
    "review": "This is when Jackie hit his prime. It might have the best ending fight scene of all time. The opening is amazing as well. It has so many memorable scenes.",
    "image": "https://upload.wikimedia.org/wikipedia/en/6/6a/TheYoungMaster.jpg"
  },
  {
    "name": "Dragon Lord",
    "synopsis": "The son (Jackie Chan) of a business tycoon tries to trap a group of thieves in pursuit of national treasures.",
    "trailer": "IsYmEa-ti8Y",
    "year": 1982,
    "rating": 8,
    "must": "",
    "period": "Colonial",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Jackie Chan",
      ""
    ],
    "review": "There's not a lot of Kung Fu in this one but the fight at the end is great. There are a few very impressive scenes revolving around different games but they have nothing to do with the overall plot. Some funny gags are peppered throughout and showcase great supporting characters.",
    "image": "https://upload.wikimedia.org/wikipedia/en/1/17/Dragon-Lord-poster.jpg"
  },
  {
    "name": "Fearless Hyena Part II",
    "synopsis": [
      "With evil forces slaughtering the entire Yin-Yang brotherhood, hope lies at the feet of two lazy kung fu prodigies."
    ],
    "trailer": "ddASvU6tmPM",
    "year": 1983,
    "rating": 5,
    "must": "",
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Chan Chuen",
      ""
    ],
    "review": "There is a long story behind the production of Fearless Hyena Part II that includes Jackie being blackmailed by triads hired by the producer. Jackie hated the film (for good reason) and didn't want to finish it. The producer finished it anyway using stand-ins and archival footage from the original Fearless Hyena. This certainly shows through much of the film. The fights are mostly not up to the Chan standard. There are several scenes that are pretty charming and throw back to the original film such as Jackie getting a job. Chan's co-star actually has an interesting character as well. He's lazy and so creates machines to do things like make him breakfast. This comes into play at the end of the film when he constructs a series of elaborate traps. It's a satisfying payoff. Sadly, there's little else on offer here and not enough Jackie face-time. ",
    "image": "https://upload.wikimedia.org/wikipedia/en/c/c5/FearlesshyenaII.jpg"
  },
  {
    "name": "Project A",
    "synopsis": [
      "Dragon Ma (Jackie Chan), is a lieutenant in the 19th-century Hong Kong marines. Pirates have been terrorizing local waters with assistance from the corrupt authorities. Dragon Ma hopes to defeat the evil pirate clan led by Sanpao (Dick Wei), but his plan is short-circuited. Ma then teams with a navy admiral (Hak Suen Lau), a police captain Tzu (Biao Yuen), and a crafty thief (Sammo Hung Kam-Bo) in a new round of high-seas battles with Sanpao and his pirates."
    ],
    "trailer": "SqUS8hzkmxA",
    "year": 1983,
    "rating": 9.5,
    "must": true,
    "period": "Colonial",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Jackie Chan",
      "Sammo Hung"
    ],
    "review": "Project A stars \"The Three Brothers\", Jackie, Sammo, and Yuen. It introduces great set pieces to Chan's fantastic fights which is a turning point for his films. Also pirates!",
    "image": "https://upload.wikimedia.org/wikipedia/en/d/dc/Project_A_Poster.jpg"
  },
  {
    "name": "Wheels On Meals",
    "synopsis": [
      "The owners (Jackie Chan, Biao Yuen) of a mobile restaurant help a private eye (Samo Hung) locate a mysterious woman."
    ],
    "trailer": "jvVrNI_WuNo",
    "year": 1984,
    "rating": 9,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Sammo Hung",
      ""
    ],
    "review": "Starring \"The Three Brothers\" again! Anything that does is an instant classic, and this film is no different. There are some slow parts in the middle, and a few jokes that fall flat, but mostly Wheels on Meals is a great time with fun jokes, awesome action, and loveable characters. It also features Jackie's fist fight with Benny Urquidez. This, and their later bout in Dragons Forever are some of the most memorable of the eighties.",
    "image": "https://upload.wikimedia.org/wikipedia/en/5/57/Wheels-on-meals.jpg"
  },
  {
    "name": "Police Story",
    "synopsis": "An honest Hong Kong cop protecting a Triad boss's girlfriend-turned-informer finds himself framed for the murder of a dirty cop and going on the run.",
    "trailer": "OfVyDegH1wk",
    "year": 1985,
    "rating": 8.5,
    "must": true,
    "period": "Modern",
    "genre": [
      "Action",
      "Kung Fu"
    ],
    "director": [
      "Jackie Chan",
      ""
    ],
    "review": "Jackie is really working in the high flying stunts here. There's lots of insane car action that supplements the kung fu but doesn't replace it. You don't get these kinds of car stunts in western movies. This is the beginning of a six part series and probably the best installment.",
    "image": "https://upload.wikimedia.org/wikipedia/en/a/a3/Police-Story-poster.jpg"
  },
  {
    "name": "Heart Of The Dragon",
    "synopsis": "A policeman (Jackie Chan) forsakes his dream of world travel to care for a mentally impaired brother (Sammo Hung) who is later kidnapped by gangsters.",
    "trailer": "Zppi00TVByI",
    "year": 1985,
    "rating": 8,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Drama"
    ],
    "director": [
      "Sammo Hung",
      ""
    ],
    "review": "This movie is a special case in that it's rated for genuinely being \"So Bad It's Good.\" If you like that sort of thing then this is the Chan movie for you. I won't spoil it, but it will suffice to say that this is Sammo's \"The Room.\" It also suffers severely from misleading poster syndrome.",
    "image": "https://upload.wikimedia.org/wikipedia/en/a/a6/Heart_of_Dragon.jpg"
  },
  {
    "name": "The Protector",
    "synopsis": "Two New York detectives (Jackie Chan/Danny Aiello), one a karate expert, go to Hong Kong on the trail of a cocaine lord (Roy Chiao).",
    "trailer": "3f_vTpJKpU4",
    "year": 1985,
    "rating": 7,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "James Glickenhaus",
      ""
    ],
    "review": "This is the obvious precursor to Rush Hour. So many things were lifted directly from The Protector and put into Rush Hour. It's directed by the B-movie legend who made The Exterminator and lots of other crazy films. Chan was super pissed about the poor quality of the film and obviously filmed some of his own scenes to save it. Chan eventually edited and released his own version. One highlight is the on-location Hong Kong stuff. They really capture the character of the city.",
    "image": "https://upload.wikimedia.org/wikipedia/en/6/67/TheProtector1985.jpg"
  },
  {
    "name": "My Lucky Stars",
    "synopsis": "A Hong Kong detective on assignment in Japan gets help from his old gang to rescue his captive partner.",
    "trailer": "fTR8GL5mf-A",
    "year": 1985,
    "rating": 3,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Sammo Hung",
      ""
    ],
    "review": "The \"Lucky Stars\" are basically the Hong Kong \"Rat Pack\". Unfortunately all their movies are terrible. This one happens to be centered mostly around rape jokes and there is very little Chan to be had.",
    "image": "https://upload.wikimedia.org/wikipedia/en/7/75/MyLuckyStars.jpg"
  },
  {
    "name": "Armour of God",
    "synopsis": "An adventurer (Jackie Chan) and his friend (Alan Tam) aid a woman (Rosamund Kwan) kidnapped by cultists seeking a set of armor with mystical powers.",
    "trailer": "eAD4HQ8Su9s",
    "year": 1986,
    "rating": 7,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Jackie Chan",
      ""
    ],
    "review": "The beginning and end of this movie are amazing but the middle is very low energy. It's sort of Jackie doing Indiana Jones. There's lots of crazy stuff that comes at a wild pace with more of an edge than usual (blackface and nudity). The ending fight is surprisingly fantastic on top of being one of the most ridiculous scenarios I've ever seen Jackie in.",
    "image": "https://upload.wikimedia.org/wikipedia/en/3/39/Armour-of-god-poster.jpg"
  },
  {
    "name": "Project A 2",
    "synopsis": "Corrupt police inspector Chun (David Lam) has made himself the most powerful law enforcement officer in Hong Kong by staging high-profile arrests of the criminals and mobsters with whom he's in cahoots. The British authorities know Chun is a dirty cop but have not been able to infiltrate his inner circle. Enter fearless and incorruptible military policeman \"Dragon Ma\" Yun (Jackie Chan), who comes back to his hometown to pose as Chun's new right-hand man and take down both cops and criminals.",
    "trailer": "E0oKxz9uvDU",
    "year": 1987,
    "rating": 7.5,
    "must": "",
    "period": "Colonial",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Jackie Chan",
      ""
    ],
    "review": "This is a sequel to the Classic Project A, but not in any real capacity. Sammo and Yuen only make cameo appearances to the film's great detriment. The action scenes are spectacular and the set pieces are even better. The climax is an absolutely classic stunt. Unfortunately there's a lot of crazy Scooby Doo hijinx in the middle that don't work well and go on for literally a half hour. I timed it. There are so many characters that everything goes off the rails. It feels like the film originally had nothing to do with Project A but the studio decided they could get more money with some brand recognition. I want to like this more than I did.",
    "image": "https://upload.wikimedia.org/wikipedia/en/6/65/Project-A-II-Poster.jpg"
  },
  {
    "name": "Police Story 2",
    "synopsis": "A dedicated Hong Kong cop's unusual policing methods result in his demotion to traffic duty despite his success in fighting crime. Meanwhile an old enemy is released from prison and sets out to get revenge.",
    "trailer": "LIcCUo7Xkxk",
    "year": 1988,
    "rating": 8,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Kung Fu"
    ],
    "director": [
      "Jackie Chan",
      ""
    ],
    "review": "This one has a few great fights in it. Also the plot is not great. It's exciting overall, but not as entertaining as the original.",
    "image": "https://upload.wikimedia.org/wikipedia/en/7/74/Police-Story-2-poster.jpg"
  },
  {
    "name": "Dragons Forever",
    "synopsis": "A lawyer (Jackie Chan) and his friends (Sammo Hung Kam-Bo/Yuen Biao) uncover illegal dealings at a Hong Kong chemical plant.",
    "trailer": "YIHtiLqSO94",
    "year": 1988,
    "rating": 10,
    "must": true,
    "period": "Modern",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Sammo Hung",
      "Corey Yuen"
    ],
    "review": "Starring \"The Three Brothers\" Jackie, Sammo, and Yuen. They are all used fabulously here. This is a great, tight film all around. It has lots of romance but it's very well done. Also, Jackie plays a lawyer and does courtroom drama! The subtitles come fast and the plot is confusing but that doesn't bother me. I feel like Breaking Bad ripped this off a little...",
    "image": "https://upload.wikimedia.org/wikipedia/en/9/92/Dragons_Forever_HK_poster.jpg"
  },
  {
    "name": "Miracles",
    "synopsis": "A poor country boy (Jackie Chan) heads Hong Kong's crime world while romancing a nightclub singer (Anita Mui) in the 1930s.",
    "trailer": "68runFBrG5M",
    "year": 1989,
    "rating": 9.5,
    "must": true,
    "period": "1930's",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Jackie Chan",
      ""
    ],
    "review": "Miracles is by far Jackie's most impressive effort as a director. It has absolutely top-tier fights with a great plot and great characters in between. Some parts go on a little long but it's worth it. A Hong Kong re-imagining of \"A Pocket Full Of Miracles.\"",
    "image": "https://upload.wikimedia.org/wikipedia/en/7/73/MiraclesFilmPoster.jpg"
  },
  {
    "name": "Island Of Fire/Jackie Chan Is The Prisoner",
    "synopsis": "A police officer (Tony Leung Ka Fai) poses as a prisoner to gather evidence of a scheme that uses inmates as expendable assassins.",
    "trailer": "qS774M0I1io",
    "year": 1990,
    "rating": 4,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Drama"
    ],
    "director": [
      "Yen-Ping Chu",
      ""
    ],
    "review": "This is repackaged as a Jackie movie, but it has almost no Jackie in it. It also has just two real fight scenes and the plot is terrible. It's only redeeming features are some decent Sammo bits.",
    "image": "https://upload.wikimedia.org/wikipedia/en/9/9f/Island-of-Fire-poster.jpg"
  },
  {
    "name": "Armour of God II: Operation Condor",
    "synopsis": "Asian Hawk (Jackie Chan) — code name Condor — is a secret agent for hire. Assigned by a Turkish duke to find stolen Nazi gold buried in the Sahara Desert, Condor must face mercenaries guards and one remaining Nazi (Aldo S?nchez), who wants the treasure he helped steal all those years ago. Even after teaming up with three inept ladies (Carol \"Do Do\" Cheng/Eva Cobo de Garcia/Shoko Ikeda), Condor still has his work cut out for him on his hunt for the stolen loot.",
    "trailer": "BP2k1zRAgQw",
    "year": 1991,
    "rating": 9,
    "must": true,
    "period": "Modern",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Jackie Chan",
      ""
    ],
    "review": [
      "This is as close as Jackie ever gets to aping Indiana Jones. The beginning and end are great, but there is a bit of a sag in the middle. Jackie has not one, but three, comic relief females tagging along on this adventure. Most of the stuff with them is pretty good too, but it does get boring at times. When the movie pops off it's really top-tier. A great motorcycle chase comes to mind, and, of course, the whole climax which takes place in a wind tunnel. The intro is charming adventure schlock through-and-through and almost a direct reference to Raiders of the Lost Ark."
    ],
    "image": "https://upload.wikimedia.org/wikipedia/en/7/7c/Armour-of-god-II-poster.jpg"
  },
  {
    "name": "Police Story 3: Supercop",
    "synopsis": [
      "To infiltrate a drug cartel, police Inspector Chan Ka Kui (Jackie Chan) goes undercover in a Chinese prison. There he earns the trust of Panther (Yuen Wah), a cartel member, by breaking him out of prison. With the help of another undercover agent (Michelle Yeaoh), they travel to Hong Kong and join up with Panther's gang. Ka Kui is accepted by the gang's leader (Ken Tsang), but his operation is jeopardized when Ka Kui's girlfriend (Maggie Cheung) accidentally reveals his true identity."
    ],
    "trailer": "KsBcuVOkEsg",
    "year": 1992,
    "rating": 8,
    "must": true,
    "period": "Modern",
    "genre": [
      "Action",
      "Kung Fu"
    ],
    "director": [
      "Stanley Tong",
      ""
    ],
    "review": "Quentin Tarantino cited this as one of his favorite movies because it contains the greatest stunts ever filmed. He was right. It's especially great because it contains Jackie's female equal, Michelle Yeoh, who even got her own spin-off. It takes a little long between action scenes, and the plot is just OK, but overall it's fantastic. ",
    "image": "https://upload.wikimedia.org/wikipedia/en/5/5a/Policestory_poster.jpg"
  },
  {
    "name": "Twin Dragons",
    "synopsis": "Decades after the abduction of his newborn twin, world-famous American pianist John Ma (Jackie Chan) arrives in Hong Kong to perform and finds himself face-to-face with Boomer (Jackie Chan), the identical twin brother he has never known. When the reunited brothers switch places by mistake John discovers that Boomer is a petty criminal with a knack for getting into trouble. Soon John gets in over his head with a group of gangsters looking for Boomer and his brother vows to save him.",
    "trailer": "6QI7XfF_O_8",
    "year": 1993,
    "rating": 8,
    "must": true,
    "period": "Modern",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Ringo Lam",
      ""
    ],
    "review": "This movie really is exactly what it sounds like. Jackie Chan plays his own twin. They end up swapping girlfriends, which is actually handled really well. A lot of times I don't like how the romance is done in Chan movies, but I do here. Also, one of the Chans is a midget's body guard.",
    "image": "https://upload.wikimedia.org/wikipedia/en/8/87/Twin-Dragons-poster.jpg"
  },
  {
    "name": "City Hunter",
    "synopsis": "U.S. criminals hijack a cruise ship with a gluttonous private eye (Jackie Chan) aboard who is seeking a magnate's missing daughter.",
    "trailer": "S87f0gp2_zM",
    "year": 1993,
    "rating": 8,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Wong Jing",
      ""
    ],
    "review": "City Hunter is a bonkers comedy that's based on an anime in which Jackie Chan plays a spy. It has the now famous Street Fighter 2 scene where Jackie portrays and fights in the style of many of the characters from that game including Chun-li. Non-stop zaniness throughout.",
    "image": "https://upload.wikimedia.org/wikipedia/en/5/55/City_Hunter_%28film%29.jpg"
  },
  {
    "name": "Crime Story",
    "synopsis": "An honest Hong Kong cop, guilt-ridden over his participation in a recent shoot-out, attempts to save a real estate developer kidnapped under his care.",
    "trailer": "IkS1wWkMXjU",
    "year": 1993,
    "rating": 8,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Kung Fu"
    ],
    "director": [
      "Kirk Wong",
      ""
    ],
    "review": "This is on the darker side. It's a gritty police story about corrupt cops kidnapping and ransoming a millionaire. It was filmed partially in Kowloon Walled City right before it got torn down so they could blow up entire buildings. Great fights and great action all around but it gets grim.",
    "image": "https://upload.wikimedia.org/wikipedia/en/9/9e/Crime-Story-Poster.jpg"
  },
  {
    "name": "Drunken Master II (The Legend of Drunken Master)",
    "synopsis": "Aided by his hilarious stepmother and friends, Hong faces the challenge of protecting valuable Chinese history and saving his family honor.",
    "trailer": "7P7tWqwKqE4",
    "year": 1994,
    "rating": 10,
    "must": true,
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Lau Kar-leung",
      "Jackie Chan"
    ],
    "review": "Drunken Master II is the reason I started this list. Every frame of it is absolutely thrilling to me. The axe gang is my favorite Chan fight ever and the climax is up there as well. It's a sequel/reboot of Drunken Master and is its better in every way.",
    "image": "https://upload.wikimedia.org/wikipedia/en/f/fc/DrunkenMasterII.jpg"
  },
  {
    "name": "Rumble In The Bronx",
    "synopsis": [
      "Hong Kong policeman Keung (Jackie Chan) arrives in New York for the wedding of his uncle Bill (Bill Tung, a grocer who recently sold his Bronx store to the fetching Elaine (Anita Mui). After a biker gang bursts into the store to wreak havoc Keung springs into action giving up his vacation to defend the weak and protect the innocent with his extraordinary martial arts skills. As Keung investigates local gangs he learns more about a criminal syndicate that needs to be brought to justice."
    ],
    "trailer": "q7vg8uGzLts",
    "year": 1995,
    "rating": 9.5,
    "must": true,
    "period": "Modern",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Stanley Tong",
      ""
    ],
    "review": "Jackie's first big hit in the west. It certainly lives up to that name. The hits come fast and don't stop. Every character is way over the top in the best way possible, including the super campy bad guys in the same style as those in \"Mr. Nice Guy\". Stanley Tong really knows his action. He often has Jackie fighting Americans instead of his usual stunt crew, but he works around that perfectly by relying on great stunt work from Jackie himself.",
    "image": "https://upload.wikimedia.org/wikipedia/en/6/6e/Rumble-in-the-Bronx-poster.jpg"
  },
  {
    "name": "Thunderbolt",
    "synopsis": "A psychotic driver kidnaps the sisters of a Hong Kong mechanic who bested him in an impromptu car race.",
    "trailer": "I2zaH8c94hU",
    "year": 1995,
    "rating": 8.5,
    "must": true,
    "period": "Modern",
    "genre": [
      "Racing",
      "Kung Fu"
    ],
    "director": [
      "Gordon Chan",
      ""
    ],
    "review": "There are a couple of fantastic fights and incredible car stunts all over this movie. It's thrilling for the first hour or so then the plot gets thrown out a bit. Jackie is sort of grim, but his charm is used well in particular moments, and especially at the end. Unfortunately, Jackie's ankle was still broken from Rumble in the Bronx so he used a stunt double in parts of the fights and it's pretty apparent from the editing. Sammo did the stunt directing and he knocked it out of the park.",
    "image": "https://upload.wikimedia.org/wikipedia/en/5/51/JCThunderbolt_poster.jpg"
  },
  {
    "name": "Police Story 4: (Jackie Chan's) First Strike",
    "synopsis": "A Hong Kong police detective Chan Ka Kui (Jackie Chan) works with the CIA to track a mysterious woman named Natasha (Grishajeva Nonna). She is suspected of delivering money to a terrorist Jackson Tsui (Jackson Liu) who is trying to obtain a nuclear warhead from the Russian mob. Traveling from Hong Kong to the Ukraine to Australia Chan aims to bust up the terrorist plot using his fists as much as his brains doing battle underwater on stilts and across mountain tops.",
    "trailer": "Fjst3TV4pz0",
    "year": 1996,
    "rating": 7,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Stanley Tong",
      ""
    ],
    "review": [
      "I expected a lot more from this movie. The best part is the famous ladder scene, which really is great. There are a couple funny and charming parts, but very little actually happens in this movie. It's short as well. I hate to say it, but I think Stanley sort of phoned this one in. \"First Strike\" wasn't billed as a Police Story movie in America and has basically nothing to do with the prior two films. It's weird that this was so popular at the time looking back on it. I do love the koala. Also there is the stilts scene..."
    ],
    "image": "https://upload.wikimedia.org/wikipedia/en/1/15/FirstStrike_Poster.jpg"
  },
  {
    "name": "Mr. Nice Guy",
    "synopsis": "Martial arts romp about a TV chef who becomes embroiled in a drug lord's search for an incriminating video. The kung-fu fighting cook steps in to save an investigative journalist on the run from a gang of murderous drug dealers resulting in a potentially fatal mix-up involving her incriminating tape of the gangsters and a children's video.",
    "trailer": "J6Py7OosyGQ",
    "year": 1997,
    "rating": 7.5,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Sammo Hung",
      ""
    ],
    "review": "Chan is a TV chef who gets caught between two rival gangs fighting over some cocaine and a video tape. The tape part makes no sense and is pure Sammo weirdness. There's a lot of great stuff here and it's way over the top. I don't like how there's no kung fu in the climax at all, even though the climax it has is bombastic. They're sort of setting up a fight with one of the bad guys the whole time but it never happens.",
    "image": "https://upload.wikimedia.org/wikipedia/en/d/db/MrNiceGuy_DVDcover.jpg"
  },
  {
    "name": "Who Am I?",
    "synopsis": "A group of covert CIA operatives trailing a potential new energy source are double-crossed by corrupt agent Morgan (Ron Smerczak), who causes a helicopter crash in remote South Africa. The sole survivor (Jackie Chan), suffering severe amnesia is nursed to recovery by a kindly native tribe who call him \"Whoami\" after the question he keeps asking. With the help of a mysterious reporter (Michelle Ferre), Whoami pieces together his past and tracks the turncoat agent and his criminal cohorts.",
    "trailer": "Gdx55aI-BLw",
    "year": 1998,
    "rating": 8.5,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Jackie Chan",
      "Benny Chan"
    ],
    "review": "A crazy charming movie with so many WTF moments. Jackie chan is a spy with amnesia that wakes up in an African tribe and is rescued by a chinese rally car racer chick. There is some super weapon that came from a meteor and an evil corporation wants to get their hands on it and... you get the idea. It also showcases perfectly the \"Jackie Moment\" as we've come to call it when Jackie stops everything to deliver some moral diatribe. Even that is charming.",
    "image": "https://upload.wikimedia.org/wikipedia/en/0/00/WhoAmIJackieChan.jpg"
  },
  {
    "name": "Rush Hour",
    "synopsis": "When a Chinese diplomat's daughter is kidnapped in Los Angeles he calls in Hong Kong Detective Inspector Lee (Jackie Chan) to assist the FBI with the case. The FBI doesn't want anything to do with Lee and they dump him off on the LAPD who assign wisecracking Detective James Carter (Chris Tucker) to watch over him. Although Lee and Carter can't stand each other they choose to work together to solve the case on their own when they figure out they've been ditched by both the FBI and police.",
    "trailer": "JMiFsFQcFLE",
    "year": 1998,
    "rating": 9,
    "must": true,
    "period": "Modern",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Brett Ratner",
      ""
    ],
    "review": "I honestly still think this movie is absolutely fantastic. Chan and Tucker just look so good on screen together. It's as hilarious as it is thrilling.",
    "image": "https://upload.wikimedia.org/wikipedia/en/5/55/Rush_hour_ver2.jpg"
  },
  {
    "name": "Gorgeous",
    "synopsis": "Young and beautiful Bu (Shu Qi) finds a romantic message in a bottle near her family restaurant in Taiwan. On a whim, she flies to Hong Kong to meet her potential soul mate who turns out to be Albert (Tony Leung Chiu Wai), a gay beautician pining for his ex. Taking pity on the girl, he brings her to his workplace where she falls for the wealthy and lonely C.N. Chan (Jackie Chan). But when Chan's lifelong enemy Lo (Emil Chow) discovers Chan has a new love he decides to ruin their happiness.",
    "trailer": "1eYxzAb4vME",
    "year": 1999,
    "rating": 5,
    "must": "",
    "period": "Modern",
    "genre": [
      "Romance",
      "Kung Fu"
    ],
    "director": [
      "Vincent Kok",
      ""
    ],
    "review": "The plot of this movie is terrible. The main characters are terrible. The romance is terrible. The side characters were great and the fight scenes were second to none. It's a real damn shame.",
    "image": "https://upload.wikimedia.org/wikipedia/en/f/f5/GorgeousPoster.jpg"
  },
  {
    "name": "Shanghai Noon",
    "synopsis": [
      "Bumbling Chon Wang (Jackie Chan) works as an Imperial guard in the Forbidden City of China. When Princess Pei Pei (Lucy Liu) is taken hostage, Wang pursues her captors to the wild frontier land of Nevada where he meets good-natured thief and occasional cowboy Roy O'Bannon (Owen Wilson). Using O'Bannon's love of money Wang convinces him to help recover the princess and together the two form a curious partnership — the likes of which the West has never seen."
    ],
    "trailer": "CPQIQ6VIfJo",
    "year": 2000,
    "rating": 6,
    "must": "",
    "period": "1800's",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Tom Dey",
      ""
    ],
    "review": "There are some little laughs here and there with Owen. Absolutely terrible cinematography editing and special effects ruin a lot of the great stuff Chan was trying to do. I know a lot of people look back on it with rose-colored glasses, but this one just didn't age well.",
    "image": "https://upload.wikimedia.org/wikipedia/en/e/ee/ShanghaiNoon_Poster.jpg"
  },
  {
    "name": "The Accidental Spy",
    "synopsis": "A less-than-successful exercise equipment salesman yearns for excitement in his life. One ordinary day Bei (Jackie Chan) follows his instincts and trails two suspicious-looking men into an alley. When he realizes they are robbing a bank Bei jumps into action and foils their plans. The resulting publicity brings Bei the shock that his parents were both professional spies. Drawn into a dangerous game of cat and mouse Bei travels to Turkey to stop a group of evil drug lords.",
    "trailer": "ozFwfBtZSzU",
    "year": 2001,
    "rating": 6,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Adventure"
    ],
    "director": [
      "Teddy Chan",
      ""
    ],
    "review": "It was almost impossible to tell what was happening in this movie most of the time. This was partially due to its being re-edited by the American distributor, but I doubt that it would have been much more enjoyable in its original form. It attempts a Mission Impossible style spy plot that falls on its face. Also, the tone is all over the place. Some scenes are super dark and others are typical \"Wacky Jackie.\" There's a big stunt at the end that is bombastic, but there are a couple smaller parts that are more memorable like when Jackie rolls himself up in a hanging cloth to form a disguise and when he floats down from the roof of a building just holding three umbrellas.",
    "image": "https://upload.wikimedia.org/wikipedia/en/b/bb/Accidental-spy-poster.jpg"
  },
  {
    "name": "Rush Hour 2",
    "synopsis": "After an explosion at the US Embassy in Hong Kong kills two customs agents investigating currency smuggling Inspector Lee (Jackie Chan) and James Carter (Chris Tucker) search for the mastermind. Ricky Tan (John Lone) head of the Fu-Cang-Long Triad sends out his minions to insure that Carter and Lee don't solve the case.",
    "trailer": "SCTzYY95Aw4",
    "year": 2001,
    "rating": 9,
    "must": true,
    "period": "Modern",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Brett Ratner",
      ""
    ],
    "review": "Most people consider this to be better than the first, but I remember liking them about the same. That's impressive in itself. There are so many memorable moments in both. It's just a blast.",
    "image": "https://upload.wikimedia.org/wikipedia/en/2/2a/Rush_Hour_2_poster.jpg"
  },
  {
    "name": "The Tuxedo",
    "synopsis": "Cabbie-turned-chauffeur Jimmy Tong (Jackie Chan) learns there is really only one rule when you work for playboy millionaire Clark Devlin (Jason Isaacs) : Never touch Devlin's prized tuxedo. But when Devlin is temporarily put out of commission in an explosive accident Jimmy puts on the tux and soon discovers that this extraordinary suit may be more black belt than black tie. Paired with a partner (Jennifer Love Hewitt) as inexperienced as he is Jimmy becomes an unwitting secret agent.",
    "trailer": "iJSxnd88AcQ",
    "year": 2002,
    "rating": 5.5,
    "must": "",
    "period": "Modern",
    "genre": [
      "Comedy",
      "Action"
    ],
    "director": [
      "Kevin Donovan",
      ""
    ],
    "review": "The Tuxedo is a spy parody essentially, and not a very good one. Jackie gets to do lots of comedy in a style we don't usually see, which is nice, but aside from that it has little to offer. Jennifer Love Hewitt is his co-star, and though I usually don't have a problem with her, she's horrendous here. She just cannot do wacky comedy. It's like the movie was just trying to slot her in as another Chris Tucker or Owen Wilson and the results are embarrassing. Unfortunately, the film doesn't even offer much in the way of action or fights as it's almost all replaced with CG and wire-work. The plot is absolutely bananas and there are almost Batman and Robin (Schumacher) vibes. I only wish that Chan had been better used here so that the plot could be funny in context instead of just uninteresting. The first act is OK and centers around Jackie driving a cab and trying to ask a girl on a date then becoming a secret agent's valet, but after that it was all downhill. Also James brown is in this movie for some reason.",
    "image": "https://upload.wikimedia.org/wikipedia/en/c/cf/The_Tuxedo_film.jpg"
  },
  {
    "name": "Shanghai Knights",
    "synopsis": "After taming the wild west in the comedy \"Shanghai Noon\" Chon Wang (Jackie Chan) and Roy O'Bannon (Owen Wilson) are back in the saddle but off the range — this time they're out to settle a score in civilized London in the sequel \"Shanghai Knights.\" When a Chinese rebel murders Chon's estranged father and escapes to England Chon and Roy make their way to London with revenge on their minds.",
    "trailer": "a26E5JR4M4A",
    "year": 2003,
    "rating": 7,
    "must": "",
    "period": "Western",
    "genre": [
      "Comedy",
      "Adventure"
    ],
    "director": [
      "David Dobkin",
      ""
    ],
    "review": "Knights was a bit better than Noon. The jokes reached both higher highs and lower lows. Fortunately, the action is presented in a much more Chan-like fashion and there seems to be more of it. The screenplay only incorporates the London locale with the least effort possible, and their attempts made my eyes roll many times.",
    "image": "https://upload.wikimedia.org/wikipedia/en/b/bf/Shanghai_knights.jpg"
  },
  {
    "name": "The Medallion",
    "synopsis": "Eddie (Jackie Chan) is an indomitable Hong Kong cop who after a near fatal accident involving a mysterious medallion is suddenly transformed into a Highbinder — an immortal warrior with inhuman powers. Eddie enlists the help of fellow agent Nicole (Claire Forlani) to determine the secret of the medallion and face down the evil Highbinders who so desperately want it back.",
    "trailer": "tMKlfGxzZD4",
    "year": 2003,
    "rating": 4,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Gordon Chan",
      ""
    ],
    "review": "Another failed attempt at a Rush Hour style teamup but this time with mystical elements. Also it's British. The Medallion features some of the most embarrassing moments of Jackie's entire career. There are stand out low points from the writing, acting, directing, effects, and action choreography. One of the worst parts is the humor. Jackie's partner here is the least funny and most obnoxious of any of his teamups. I honestly didn't think it could get worse than Jennifer Love Hewitt. Jackie is severely underutilized since almost all the action is effect-based. There's no entertainment to be had here, only frustration. There's a scene where Jackie's love interest gets into a fight with the villain's female henchman and a cat yowl is literally dubbed over it.",
    "image": "https://upload.wikimedia.org/wikipedia/en/0/0c/The_Medallionposter.jpg"
  },
  {
    "name": "Around The World in 80 Days",
    "synopsis": "Phileas Fogg (Steve Coogan) is an inventor living in Victorian England. He believes he can travel around the world in 80 days. Another inventor (Jim Broadbent) challenges him to make the trip and Phileas agrees. Accompanying Phileas on his journey are his loyal manservant Passepartout (Jackie Chan) and Monique (C?cile de France) a beautiful navigator. Utilizing a variety of transportation means and Passepartout's martial arts skills the trio embarks on a globe-spanning adventure.",
    "trailer": "IlsgwJUNFNU",
    "year": 2004,
    "rating": 8,
    "must": "",
    "period": "Colonial",
    "genre": [
      "Comedy",
      "Adventure"
    ],
    "director": [
      "Frank Coraci",
      ""
    ],
    "review": "Very family friendly and off the charts wacky, but some genuinely fun stuff all over. Arnold Schwarzenegger's cameo is legendary. This is based on the classic Jules Verne novel, obviously.",
    "image": "https://upload.wikimedia.org/wikipedia/en/6/6b/Movie_poster_Around_the_World_in_80_Days.jpg"
  },
  {
    "name": "New Police Story",
    "synopsis": "Inspector Chan Kwok-Wing (Jackie Chan) was once the shining star of the Hong Kong police force. That all changed when his unit was slaughtered by a merciless gang of bank robbers — and Chan turned to the bottle to drown his grief. Now a year later a soused Chan is dragged out of his rut by a new partner Frank Cheng (Nicholas Tse). Together they hit the streets to redeem Chan's reputation by going after those responsible for the deaths of his fellow officers.",
    "trailer": "DdEvxSxZAdE",
    "year": 2004,
    "rating": 1,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      ""
    ],
    "director": [
      "Benny Chan",
      ""
    ],
    "review": "This movie is miserable. It's a reboot of the \"Police Story\" franchise that tries to make it super dark and serious and only succeeds in destroying the series. If I told you about some of the stuff in this movie you would laugh and think it sounded funny, but I assure you it is not funny or fun in any way. Part of the problem is that it has the most obnoxious villains of all time. That extends to Jackie's partner as well. Another huge issue is the sound-track which sounds like a ripoff of \"The Phantom Menace.\"",
    "image": "https://upload.wikimedia.org/wikipedia/en/8/8c/NewPoliceStoryposter.jpg"
  },
  {
    "name": "The Myth",
    "synopsis": "An archaeologist is perplexed when he begins to have dreams of a past life as an ancient warrior. When asked to join an expedition trying to locate the mausoleum of China's first emperor he discovers his visions are based in fact and he finds himself following a mystical trail to uncover one of his homeland's biggest mysteries.",
    "trailer": "8nj3heOygHM",
    "year": 2005,
    "rating": 7,
    "must": "",
    "period": "Feudal",
    "genre": [
      "Adventure",
      "Kung Fu"
    ],
    "director": [
      "Stanley Tong",
      ""
    ],
    "review": "The Myth feels like an episode of Wishbone because of both the timewarping style of storytelling and the production quality. As I find myself saying so often, the fights are fantastic. The battle scenes, however, are terrible except for when they stray in to the hilariously absurd. Perhaps the most entertaining character is Chan's trusty horse Black Wind who does much of Chan's fighting for him. This is a hard movie to rate. For example, it has lots of terrible CGI, but much of it falls into \"so bad it's good\" territory, and there are also many fantastic practical effects. Sometimes the direction is just baffling. I'm almost certain that in the largest battle sequence they couldn't get Jackie on set at the same time as all the extras (probably out with an injury) and so they just green-screened him in and threw some dust over every shot to try to hide it. The editing moves along at lightspeed the whole time, which I technically hate, but I'm almost thankful for it here as it gets me through the lows and into the next highlight quicker. Thanks to this I found myself laughing most of the time.  ",
    "image": "https://upload.wikimedia.org/wikipedia/en/8/81/The_Myth_film.jpg"
  },
  {
    "name": "Rob-B-Hood",
    "synopsis": "Rob-B-Hood tells the story of a kidnapping gone wrong in Hong Kong; a trio of burglars consisting of Thongs (Chan) Octopus (Koo) and the Landlord (Hui) kidnap a baby from a wealthy family on behalf of triads. With the Landlord arrested Thongs and Octopus take care of the baby for a short time developing strong bonds with him. Reluctant to hand the baby over the two are forced to protect him from the triads who hired them in the first place.",
    "trailer": "LMBczb7YULQ",
    "year": 2006,
    "rating": 7.5,
    "must": "",
    "period": "Modern",
    "genre": [
      "Comedy",
      "Kung Fu"
    ],
    "director": [
      "Benny Chan",
      ""
    ],
    "review": "Basically Jackie Chan does \"Baby's Day Out.\" The characters and side characters are all very charming. It has some dramatic moments that are actually nuanced and work really well and then some that are cheap and way over the top; especially at the end. Also, Chan is a criminal in a sort of redemption story which is a fresh take. The fights are impressive and entertaining all the way through and beautifully shot. I was not a fan of the gross-out baby humor.",
    "image": "https://upload.wikimedia.org/wikipedia/en/3/33/Rob-B-Hood_movie_poster.jpg"
  },
  {
    "name": "Rush Hour 3",
    "synopsis": "East meets West again when the assassination of Ambassador Han leads to the reunion of Lee (Jackie Chan) and Carter (Chris Tucker). In Paris the pair must stay one step ahead of Chinese gangsters and Lee's childhood friend (Hiroyuki Sanada) as they track down an envelope containing the identity of a powerful crime lord.",
    "trailer": "4CWJ7mJ9GfE",
    "year": 2007,
    "rating": 6,
    "must": "",
    "period": "Modern",
    "genre": [
      "Kung Fu",
      "Comedy"
    ],
    "director": [
      "Brett Ratner",
      ""
    ],
    "review": "I think it says a lot that I remember almost nothing about this movie. It was a bit of a disappointment. There was a lot of cringy humor and not a lot of action.",
    "image": "https://upload.wikimedia.org/wikipedia/en/4/44/Rushhour3poster.jpg"
  },
  {
    "name": "The Forbidden Kingdom",
    "synopsis": "While rummaging around for some bootleg kung-fu DVDs in a pawn shop in Boston's Chinatown, Jason discovers an ancient golden staff. When he examines the staff closely he finds himself magically transported back to ancient China where he is quested to free the fabled warrior the Monkey King with the help of a kung fu master and a misfit warrior. If he doesn't succeed he may be trapped deep in the past forever.",
    "trailer": "0ojXP0tLPV0",
    "year": 2008,
    "rating": 8,
    "must": "",
    "period": "Feudal",
    "genre": [
      "Kung Fu",
      ""
    ],
    "director": [
      "Rob Minkoff",
      ""
    ],
    "review": "The Jackie Chan and Jet Li crossover movie. It's pretty sweet, but there's lots of wire work, which I'm not crazy about. It has a cool concept at the core of it sort of like \"The Karate Kid\" mixed with \"Back to the Future\", but I don't like the kid much. Also, I guess The Monkey King is in it which is a crazy crossover. I don't know if this is actually a story from \"Journey to the West.\"",
    "image": "https://upload.wikimedia.org/wikipedia/en/5/51/ForbiddenKingdomPoster.jpg"
  },
  {
    "name": "Shinjuku Incident",
    "synopsis": "Steelhead must cross the sea and head to Japan to find out what happened to his partner when she left China.",
    "trailer": "drdQ2lVpyWg",
    "year": 2009,
    "rating": 5.5,
    "must": "",
    "period": "Modern",
    "genre": [
      "Drama",
      "Action"
    ],
    "director": [
      "Derek Yee",
      ""
    ],
    "review": "There are good things abount Shinjuku Incident, but they're too few and far between. Some of the best parts are unintentionally funny. I like the intro and the whole setup. Mostly, however, it's another gory, overly dramatic film that tries to make Jackie Chan into some impossibly honorable superhuman. This is fine when the film isn't so serious, but, like many other recent Chan movies, Shinjuku Incident is about as serious as it gets. Chan's role as a gansgter in a Goodfellas type of story would be refreshing, but he's just the same, honorable Chan as always, except he doesn't know Kung Fu. Also, this is partially Chinese propaganda. In fact, the last like of the final title card literally says that China's economy is booming.",
    "image": "https://upload.wikimedia.org/wikipedia/en/9/94/ShinjukuIncidentPoster.jpg"
  },
  {
    "name": "The Spy Next Door",
    "synopsis": "Bob Ho (Jackie Chan), an undercover operative for the CIA, decides to give up his career and marry his girlfriend Gillian (Amber Valletta). First, however, he has one more mission to complete: Gain the approval of Gillian's children. Bob volunteers to baby-sit when Gillian is called away but the operation hits a snag when one of the kids mistakenly downloads a top-secret formula and a Russian terrorist takes aim at Bob's prospective family.",
    "trailer": "yrrkQFf6QvI",
    "year": 2010,
    "rating": 3,
    "must": "",
    "period": "Modern",
    "genre": [
      "Comedy",
      ""
    ],
    "director": [
      "Brian Levant",
      ""
    ],
    "review": "It's exactly what it sounds like: a comedy for little kids. I didn't watch the whole thing. I'm sure it would be entertaining for children, but it's too sterile for me.",
    "image": "https://upload.wikimedia.org/wikipedia/en/6/6d/Spy_next_door_ver2.jpg"
  },
  {
    "name": "Little Big Soldier",
    "synopsis": "An old soldier captures a young general after a battle in China and takes him on a long journey to collect a reward.",
    "trailer": "UyzLzOC2Z5s",
    "year": 2010,
    "rating": 10,
    "must": true,
    "period": "Feudal",
    "genre": [
      "War",
      "Drama"
    ],
    "director": [
      "Ding Sheng",
      ""
    ],
    "review": "Little Big Soldier is a crazy high production value war movie and it contains probably the best actual acting Chan has ever done, both comedic and dramatic. I love Jackie's character in it. The ending hits the feels hard. Fantastic from front to back.",
    "image": "https://upload.wikimedia.org/wikipedia/en/9/9e/LittleBigSoldierPoster.jpg"
  },
  {
    "name": "The Karate Kid",
    "synopsis": "When his mother's career results in a move to China, 12-year-old Dre Parker (Jaden Smith) finds that he is a stranger in a strange land. Though he knows a little karate, his fighting skills are no match for Cheng the school bully. Dre finds a friend in Mr. Han (Jackie Chan), a maintenance man who is also a martial-arts master. Mr. Han teaches Dre all about kung fu in the hope that Dre will be able to face down Cheng and perhaps win the heart of a pretty classmate named Mei Ying.",
    "trailer": "2SmmxvHLsKk",
    "year": 2010,
    "rating": 7.5,
    "must": "",
    "period": "Modern",
    "genre": [
      "Kung Fu",
      ""
    ],
    "director": [
      "Harald Zwart",
      ""
    ],
    "review": "Karate Kid succeeds in reproducing the spirit of the original without it's relatability or sense of excitement. Jaden Smith does a decent enough job, and is basically a miniature version of his father, but he's just too young. It's hard to see twelve year olds as much of a threat. On the other hand, Jackie is wonderful, and the training montages are fantastic. The choreography is good, but a bit underserved by the cinematography. That's likely due to Smith's lack of ability as a martial artist. His bully in the film is actually fantastic. The love story is forgettable, and the ending goes over the top, but Karate Kid hits the character development very well, and ends up being memorable and enjoyable because of it.",
    "image": "https://upload.wikimedia.org/wikipedia/en/d/d5/Karate_kid_ver2.jpg"
  },
  {
    "name": "Police Story 2013",
    "synopsis": "While visiting his estranged daughter (Jing Tian) at a nightclub, a police captain (Jackie Chan) must spring into action when an elaborate kidnapping plan unravels right before his eyes.",
    "trailer": "FATbMQZtcTs",
    "year": 2013,
    "rating": 7,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      ""
    ],
    "director": [
      "Ding Sheng",
      ""
    ],
    "review": "Super slick action flick that is actually kind of an anthology of lots of short films. I like the style, but the editing and cinematography are too elaborate for their own good. It lacks the clarity that Chan movies require. The plot is a bit overwrought but I'm glad they brought \"Police Story\" back in decent way.",
    "image": "https://upload.wikimedia.org/wikipedia/en/3/3f/PoliceStory2013.jpg"
  },
  {
    "name": "Dragon Blade",
    "synopsis": "An exiled Chinese general (Jackie Chan) offers shelter to a renegade Roman (John Cusack) and his legion, then becomes involved in the soldier's dispute with Rome's villainous consul (Adrien Brody).",
    "trailer": "kUs8tWJ0EWM",
    "year": 2015,
    "rating": 5,
    "must": "",
    "period": "Feudal",
    "genre": [
      "War",
      "Drama"
    ],
    "director": [
      "Daniel Lee",
      ""
    ],
    "review": "A lot of Jackie's movies these days are full on Honor Porn, and Dragon Blade is one of the most obvious examples. The problem with this is that, though Chan's character is likeable, everything he does and everything that happens to him is predictable to a hilarious degree (literally laugh-out-loud funny). The plot of Dragon Blade is therefore extremely simplistic. The part that I do appreciate is the bromance between Chan and Cusack that flowers as they work together to repair a city that was seiged at some point. That was never explained, or if it was it was during a brief expository flashback, the same way as the rest of the plot. Cusack and Brody are both alternating between way over the top and phoning it in depending on the scene. There are a few genuinely fun scenes that consist of quality Jackie action, and some wildly weird visuals (a corpse being held upright by the many arrows stuck in his back), but I don't think I will ever enjoy the Honor Porn genre.",
    "image": "https://upload.wikimedia.org/wikipedia/en/0/04/DragonBladefilm.jpg"
  },
  {
    "name": "Skiptrace",
    "synopsis": "A detective from Hong Kong teams up with an American gambler to capture the crime lord who killed his partner and kidnapped his partner's daughter.",
    "trailer": "kkkOCtOrAcA",
    "year": 2016,
    "rating": 5,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Renny Harlin",
      ""
    ],
    "review": "This is Chan's team up with Johnny Knoxville. It's as bad as it sounds. They travel around all over the world getting into trouble. There are some nice scenes but not enough for a recommendation.",
    "image": "https://upload.wikimedia.org/wikipedia/en/2/2d/Skiptrace_American_Poster.jpg"
  },
  {
    "name": "Railroad Tigers",
    "synopsis": "A railroad worker (Jackie Chan) and his ragtag group of freedom fighters find themselves on the wrong side of the tracks when they decide to ambush a heavily armed military train filled with desperately needed provisions. Unarmed and outnumbered, they must rely on their wits to battle an entire army.",
    "trailer": "xzyE4m1BDkI",
    "year": 2016,
    "rating": 7,
    "must": "",
    "period": "1940's",
    "genre": [
      "Action",
      "Comedy"
    ],
    "director": [
      "Ding Sheng",
      ""
    ],
    "review": "A crazy cg-fest, but pretty entertaining. It gets a little over the top at the end. It's basically a crazy war-time train heist with a colorful cast of characters in the vein of \"The Dirty Dozen\" or \"Guns of the Navarone.\"",
    "image": "https://upload.wikimedia.org/wikipedia/en/d/d2/Railroad_Tigers_poster.jpeg"
  },
  {
    "name": "Chinese Zodiac",
    "synopsis": "A treasure hunter (Jackie Chan) and his team set out on a global quest to find a set of Chinese zodiac bronze heads that were stolen from a Beijing palace in the 19th century.",
    "trailer": "_Qcg2dSbgVk",
    "year": 2017,
    "rating": 5,
    "must": "",
    "period": "Modern",
    "genre": [
      "Adventure",
      "Comedy"
    ],
    "director": [
      "Jackie Chan",
      ""
    ],
    "review": "An ultimately forgettable, over-the-top adventure romp. There are a few cool action set peices. Really, I think the roller-blade suit in the intro was the best part.",
    "image": "https://upload.wikimedia.org/wikipedia/en/4/4c/ChineseZodiacHKposter.jpg"
  },
  {
    "name": "Kung Fu Yoga",
    "synopsis": "Jack (Jackie Chan), a world-renowned archaeology professor and his team are on a grand quest to locate a lost ancient Indian treasure when they are ambushed by a team of mercenaries and left for dead. Using his vast knowledge of history and kung fu Jack leads his team on a race around the world to beat the mercenaries to the treasure and save an ancient culture.",
    "trailer": "2UTnMVS6G5Y",
    "year": 2017,
    "rating": 2,
    "must": "",
    "period": "Modern",
    "genre": [
      "Adventure",
      "Comedy"
    ],
    "director": [
      "Stanley Tong",
      ""
    ],
    "review": "I couldn't make it through this. Chan (kung fu) teams up with some indian martial artist woman (Yoga) . This is another one of his modern films that looks like a J Crew ad. It's a shame when Stanley Tong used to put so much work into such charming films. I did skip to the ending however, to watch the big Bollywood dance number.",
    "image": "https://upload.wikimedia.org/wikipedia/en/d/d8/Kung_Fu_Yoga_poster.jpg"
  },
  {
    "name": "The Foreigner",
    "synopsis": "Quan is a humble London businessman whose long-buried past erupts in a revenge-fueled vendetta when the only person left for him to love -- his teenage daughter -- dies in a senseless act of politically motivated terrorism. His relentless search to find the terrorists leads to a cat-and-mouse conflict with a British government official whose own past may hold the clues to the identities of the elusive killers.",
    "trailer": "AgReM1SEWNE",
    "year": 2017,
    "rating": 8,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      ""
    ],
    "director": [
      "Martin Campbell",
      ""
    ],
    "review": "Martin Campbell is the first director to get a legitimately good against-type performance out of Jackie Chan. He knows what to show and what not to show, and in The Foreigner less is often more. Chan plays a grim character out for revenge for his daughter's death. He doesn't make faces or do much kung fu, but still caries the film almost exclusively despite the fact that he's often not on camera. His character looms over many of the scenes that he's he's not present for in a way that builds tension. The plot is predictable and formulaic, and Brosnan's accent is... unfortunate, but aside from that The Foreigner is pretty great and a real achievement for Chan. Hopefully this is the beginning of a trend.",
    "image": "https://upload.wikimedia.org/wikipedia/en/0/05/The_Foreigner_%282017_film%29.jpg"
  },
  {
    "name": "Bleeding Steel",
    "synopsis": "Hong Kong police inspector Lin Dong learns that a biochemical invention has been surgically implanted into his missing daughter. With help from a hacker, Lin tries to connect the dots between the device, a sinister army and a strange phenomenon.",
    "trailer": "PycUqhQxR1Y",
    "year": 2017,
    "rating": 3,
    "must": "",
    "period": "Modern",
    "genre": [
      "Action",
      "Drama"
    ],
    "director": [
      "Leo Zhang",
      ""
    ],
    "review": "Bleeding Steel was a pretty huge disappointment for me. I'm an enormous fan of sci-fi and it was something I hadn't really seen out of Chan before. Unfortunately, I still barely have. I kept waiting for Jackie to get sucked into the future or blast off into space, but it never happened. The plot that I was subjected to was nonsensical and trite. Basically, a mad scientist invents an artificial heart that turns people into future-vampires. They fly around in a star-destroyer for some reason. The whole aesthetic is kind of a Matrix rip-off, too. This script just could not be worse. It plays into this weird triend in modern Chinese movies that fuses crazy gore with overwrought melodrama to try to build up the protagonist as some super honorable guy, but it's totally unbelievable. Also, why do people keep trying to make Jackie so grim? It doesn't work.",
    "image": "https://upload.wikimedia.org/wikipedia/en/1/17/Bleeding_Steel_US_Poster.jpg"
  }
]
